---
kind: other
id: Methods.T:Autodesk.Revit.DB.Plumbing.PipingSystemType
source: html/e45b8741-be53-67f8-9fb6-5e6c3da1cb65.htm
---
# PipingSystemType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.